In [16]:
# Instalando os Pacotes - Mysql
!pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\autologon\appdata\roaming\python\python311\site-packages (1.1.0)

In [17]:
# importar o módulo pymysql e a bibliotexa pandas
import pymysql
import pandas as pd

In [18]:
# converter do pymysql para o Mysql
pymysql.install_as_MySQLdb()

In [19]:
#import mysql.connector
import MySQLdb

In [20]:
# Configurações para MYSQL connection
db = MySQLdb.connect(
    host="localhost",
    user="root",
    password="unipe",
    database='hotel'
)

In [21]:
# Cricar um objeto cursor. Isso permitirá que você execute todas as consultas necessárias
cur = db.cursor()

In [22]:
# Selecionar o que retornar todos os dados da tabela.
cur.execute("SELECT * FROM Cliente")

4

In [23]:
# Converter os dados para DATAFRAME
tb_cliente_mysql = pd.DataFrame(cur.fetchall())

In [24]:
# Visualizar os dados do DATAFRAME
tb_cliente_mysql.head()

                0      1  2                3   4
0  131.537.214-24  Maria  F  (63) 99577-5078  30
1  278.089.756-21   João  M  (68) 98851-2344  24
2  822.253.401-70  Pedro  M  (71) 98254-7610  38
3  894.189.461-14    Ana  M  (67) 99693-3933  25

In [25]:
#Adicionar o nome para as colunas
tb_cliente_mysql = tb_cliente_mysql.rename(columns={
                                                    0: 'CPF',
                                                    1: 'Nome',
                                                    2: 'Gênero',
                                                    3: 'Telefone',
                                                    4: 'idade',
                                                })

In [26]:
# Visualizar os dados com as colunas renomeadas
tb_cliente_mysql.head()

              CPF   Nome Gênero         Telefone  idade
0  131.537.214-24  Maria      F  (63) 99577-5078     30
1  278.089.756-21   João      M  (68) 98851-2344     24
2  822.253.401-70  Pedro      M  (71) 98254-7610     38
3  894.189.461-14    Ana      M  (67) 99693-3933     25